// ) написать программу, которая считывает через prompt число и выводит фразу "четное" или "нечетное" в зависимости от числа.

// const value = +prompt('укажите число');
// if(value % 2 ===0){
//     console.log("чётное")
// }else{
//     console.log("нечётное")
// }

// ______________________________________________________________________________________________________________________________

// написать программу, которая считывает два числа и выводит "делится" или "не делится" в зависимости от того, делится первое число на второе или нет.

// const value_1 = +prompt("укажите число");
// const value_2 = +prompt("укажите число");
// if(value_1 % value_2 ===0){
//     console.log("Делится")
// }else{
//     console.log("Не делится")
// }

// ______________________________________________________________________________________________________________________________

// написать программу, которая считывает стороны прямоугольного треугольника и выводит его площадь.

// const value_1 = +prompt("укажите число");
// const value_2 = +prompt("укажите число");
// const value_3 = +prompt("укажите число");

// if(value_1 > value_2 && value_1 > value_3){
//     console.log((value_2 * value_3) * 0.5)
// }else if(value_2 > value_1 && value_2 > value_3){
//     console.log((value_1 * value_3) * 0.5)
// }else{
//     console.log((value_1 * value_2) * 0.5)
// }

// площадь = 0.5(a*b) где a b  катеты.

// ______________________________________________________________________________________________________________________________

// написать программу, которая получает длины катетов прямоугольного треугольника и выводит гипотенузу.

// const a = +prompt("укажите число");
// const b = +prompt("укажите число");

// console.log((a * a + b * b) ** 0.5);

//  a^2 + b^2 = c^2
// ______________________________________________________________________________________________________________________________

// написать программу, которая получает число. Если оно делится на 3 или на 7 без остатка или делится на 10 с остатком, то выведите "YES" в ином случае "NO".

// const value = +prompt("число");
// if(value % 3 ===0 && value % 7 ===0 || value % 10 !== 0 ){
//     console.log('Yes')
// }else{
//     console.log('No')
// }
